In [1]:
import pandas as pd

In [3]:
dict1 = {
    "name":["Rahul", "Jaggi", "Billa"],
    "Marks":[50, 90, 60],
    "City":["Delhi", "Chandigarh", "Amritsar"]
}

In [7]:
df = pd.DataFrame(dict1)
df

    name  Marks        City
0  Rahul     50       Delhi
1  Jaggi     90  Chandigarh
2  Billa     60    Amritsar